Classes | Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::RoutingNodeDefault Class Reference
MEP Element Manager
The RoutingNodeDefault contains the necessary non-geometric data for creating and modifying a Routing Node. More...
#include <MEPRoutingNodeDefault.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingNodeDefault:
 Classes
class  | Modifier
Modifier of the RoutingNodeDefault. More...
 Public Member Functions
ElbowDefault  | GetElbowDefault () const
TransitionDefault  | GetTransitionDefault () const
Domain  | GetDomain () const
PreferredTransitionPlacement  | GetPreferredTransitionPlacement () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
RoutingNodeDefault (std::shared_ptr< Impl::IRoutingNodeDefaultImpl > impl)
Constructs a RoutingNodeDefault with the given implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Static Protected Member Functions
static Result< RoutingNodeDefault >  | Create (const API_Token &token, Domain domain)
Creates a RoutingNodeDefault with the given token and domain.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< RoutingNodeDefault >  | CreateRoutingNodeDefault (Domain domain)
Creates a RoutingNodeDefault.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RoutingNodeDefault contains the necessary non-geometric data for creating and modifying a Routing Node.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault RoutingNodeDefault Modification
 // PickUp RoutingElementDefault from RoutingElement
 RoutingElementDefault routingElementDefault = routingElement.PickUpDefault ();
 // Get RoutingNodeDefault of RoutingElementDefault and modify it
 RoutingNodeDefault routingNodeDefault = routingElementDefault.GetRoutingNodeDefault ();
 ACAPI::Result<void> nodeDefaultModifyResult = routingNodeDefault.Modify ([&](RoutingNodeDefault::Modifier& modifier) {
 modifier.SetPreferredTransitionPlacement (PreferredTransitionPlacement::LargeToSmall);
 });
 if (nodeDefaultModifyResult.IsErr ())
 return nodeDefaultModifyResult.UnwrapErr ().kind;
 // Get ElbowDefault and modify it
 ElbowDefault elbowDefault = routingNodeDefault.GetElbowDefault ();
 ACAPI::Result<void> elbowDefaultModifyResult = elbowDefault.Modify ([&](ElbowDefault::Modifier& modifier) {
 modifier.SetFactorRadius (0.6);
 });
 if (elbowDefaultModifyResult.IsErr ())
 return elbowDefaultModifyResult.UnwrapErr ().kind;
 // Get TransitionDefault and modify it
 TransitionDefault transitionDefault = routingNodeDefault.GetTransitionDefault ();
 ACAPI::Result<void> transitionDefaultModifyResult = transitionDefault.Modify ([&](TransitionDefault::Modifier& modifier) {
 modifier.SetAngle (35.0);
 });
 if (transitionDefaultModifyResult.IsErr ())
 return transitionDefaultModifyResult.UnwrapErr ().kind;
 // Set ElbowDefault and TransitionDefault back to RoutingNodeDefault
 ACAPI::Result<void> nodeDefaultSetBackResult = routingNodeDefault.Modify ([&](RoutingNodeDefault::Modifier& modifier) {
 modifier.SetElbowDefault (elbowDefault);
 modifier.SetTransitionDefault (transitionDefault);
 });
 if (nodeDefaultSetBackResult.IsErr ())
 return nodeDefaultSetBackResult.UnwrapErr ().kind;
 // Set RoutingNodeDefault back to RoutingElementDefault
 ACAPI::Result<void> elementDefaultModifyResult = routingElementDefault.Modify ([&](RoutingElementDefault::Modifier& modifier) {
 modifier.SetRoutingNodeDefault (routingNodeDefault);
 });
 if (elementDefaultModifyResult.IsErr ())
 return elementDefaultModifyResult.UnwrapErr ().kind;
 // Inject RoutingElementDefault into RoutingElement
 ACAPI::Result<void> injectResult = routingElement.Modify ([&routingElementDefault](RoutingElement::Modifier& modifier) {
 modifier.Inject (routingElementDefault);
 }, "Inject Default into RoutingElement.");
 if (injectResult.IsErr ())
 return injectResult.UnwrapErr ().kind;
 return NoError;
Constructor & Destructor Documentation
◆ RoutingNodeDefault()
 ACAPI::MEP::RoutingNodeDefault::RoutingNodeDefault  |  ( |  std::shared_ptr< Impl::IRoutingNodeDefaultImpl > |  impl | )
protected
Constructs a RoutingNodeDefault with the given implementation.
Parameters
impl | The given implementation.
Member Function Documentation
◆ Create()
 static Result< RoutingNodeDefault > ACAPI::MEP::RoutingNodeDefault::Create  |  ( |  const API_Token & |  token,
|  Domain |  domain )
staticprotected
Creates a RoutingNodeDefault with the given token and domain.
Parameters
token | The given token.
domain | The given domain.
Returns
The result of the creation with the created RoutingNodeDefault.
◆ GetDomain()
 Domain ACAPI::MEP::RoutingNodeDefault::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the default.
◆ GetElbowDefault()
 ElbowDefault ACAPI::MEP::RoutingNodeDefault::GetElbowDefault  |  ( |   | ) |   const
Returns
Returns the ElbowDefault of the RoutingNodeDefault.
◆ GetPreferredTransitionPlacement()
 PreferredTransitionPlacement ACAPI::MEP::RoutingNodeDefault::GetPreferredTransitionPlacement  |  ( |   | ) |   const
Returns
Returns the rule of the Elbow-Transition placement order of the RoutingNodeDefault.
◆ GetTransitionDefault()
 TransitionDefault ACAPI::MEP::RoutingNodeDefault::GetTransitionDefault  |  ( |   | ) |   const
Returns
Returns the TransitionDefault of the RoutingNodeDefault.
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::MEP::RoutingNodeDefault::Modify  |  ( |  ModifierFunc && |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
Friends And Related Symbol Documentation
◆ CreateRoutingNodeDefault
 Result< RoutingNodeDefault > CreateRoutingNodeDefault  |  ( |  Domain |  domain | )
friend
Creates a RoutingNodeDefault.
Parameters
domain | The Domain of the requested RoutingNodeDefault.
Returns
If able, returns a copy of Archicad's current Default of the RoutingNode from the RoutingElement tool for the domain defined by the parameter, otherwise Error.